do
 function run(msg, matches)
local text = [[ 
>>لیست ابزار های ربات TElE SERS:
_____________________
»دریافت وضعیت ارز
!arz

»دریافت اوقات شرعی
!azan [نام شهر]

»دریافت عکس های P.o.r.n
!boobs

»دریافت شماره ربات
!share

»انجام محاسبات ریاضی
!calc 2+2

»تکرار متن
!echo [متن]

»برای فیلتر کردن کلمه
filter + [کلمه]
و برای خارج کردن از فیلتر
filter - [کلمه]

»برای دیدن درباره خود
info
!aboutme
#infome
»برای مشاهده اطلاعات یک اکانت گیت هاب
github [نام پروژه] [نام گیت هاب] 

»برای جستوجو در گوگل
!google [متن]

»برای مشاهده راهنما کامل
helps

»برای نوشتن بر روی عکس
!meme [متن] [موضوع پس زمینه]

»برای دیدن مقام خود
!me

»برای تنظیم لینک
!setlink [لینک] [نام گروه]
و برای دریافت لینک
!get [نام گروه]

»برای دیدن درباره خود
info
»برای کار با آیپی
ip
config [ip]
ping [ip]
getip

»(برای دریافت لینک گروه در خصوصی(لطفا برای جلوگیری از ریپورت شدن ربات شماره ربات را ذخیره کنید
!linkpv


»برای اسپم دادن از طرف ربات
spam
»برای دریافت یوزرنیم تمام کاربران
!tagall .

»برای تبدیل متن به عکس
!tex [متن]

»برای دریافت زمان
!time [نام شهر]

»برای جستوجو در ویکی پدیا
!wiki [موضوع]

»برای کار با زیبا نویس
write [متن]

»تبدیل متن به صدا
!voice [متن]

»برای دریافت اب و هوا
!weather [نام شهر]

»برای دریافت موج رادیو
نام رادیو را بفرستید

»دریافت خدمات ایرانسل
!irancell

»دریافت کد های مخفی اندروید
!secretcode
سکرت کد
>>برای اختار به دیگران 
{ریپلی}   /warn
>>برای دیدن انلاین شبکه های تلوزیونی
!tv
<<برای خرید گروه
!buy
>>برای دریافت نقشه
!map{مکان مورد نظر}
>>برای دریافت راهنما
Helpبدون علامت
_______________________
>>پایان
]]
return text
end
return {
patterns = {
"^[!/#](helppl)$",
},
run = run
}
end
